# -*- coding: utf-8 -*-
import re

# 患儿基本信息
'''
二、患儿基本信息
定位：
<h3>住院号：2019120604152 &nbsp;</h3>
excel抓取住院号对应的病人ID
<div style="border-bottom: solid 1px #000">下的<p>元素抓取其他信息

'''
patterns_1_hospital = {
    "医院名称":"浙江萧山医院",
    "就诊科室": r"<h3>住院科室：(.*?)&nbsp;</h3>", #任意字符，&nbsp;表示到""为止
}


patterns_2_basic = {
    #"病人id":暂时不写，要从excel抓取
    "住院号":r"<h3>住院号：(.*?)&nbsp;</h3>",
    "性别": r"性别：(.*?)(?=<br>)",#任意字符，到<br>为止
    "年龄": r"年龄：(.*?)(?=<br>)",
    "民族": r"民族：(.*?)(?=<br>)",
    "户籍类型":"",
    "体重":"",
    "身高":"",
    "孕次":r"孕(\d+)",
    "产次":r"产(\d+)",
    "孕周":r"(足月)",
    "早产史":r"(足月)",
    # "出生体重":"",
    # "出生缺陷":"",
    # "营养不良":"",
    # "贫血":"",
    # "既往病史":"",
}

# 输入的文本
text = """
<h3>患者：祝诗清 &nbsp;</h3>
<h3 style="font-size: 14px"></h3>
<h3>住院号：2019120604152 &nbsp;</h3>
<h3 style="font-size: 14px"></h3>
<h3>住院科室：儿科 &nbsp;</h3>
<div style="border-bottom: solid 1px #000"><h3>入院记录</h3><p>入院记录姓名：祝诗清出生<br>地址：浙江萧山<br>性别：女性<br>出生日期：2019年01月30日<br>年龄：10个月<br>入院时间：2019年12月06日11时08分<br>职业：散居儿童<br>记录时间：2019年12月06日11时31分<br>民族：汉族<br>病史陈述者：父母<br>婚姻：未婚联系<br>地址：浙江杭州萧山临浦金榈湾15-2-601<br><br>主诉：发热2天，抽搐1次。<br><br>现病史：患儿2天前无明显诱因下出现发热，体温最高39.9℃，偶有咳嗽，无咳痰，伴流涕，无气喘气促，首次就诊于：我院，予“奥司他韦颗粒”口服1天，11小时前出现抽搐1次，当时体温未测，抽搐呈全身性大发作，表现为双眼直视，四肢强直，牙关紧闭，呼之不应，历时2-3分钟后抽搐停止，后安静入睡，偶咳嗽，无气急，无呕吐腹泻，无皮疹，否认外伤史。就诊于第三人民医院，予“地塞米松针”静滴1天（12.05），为进一步治疗，拟“高热惊厥，急性上呼吸道感染”收住入院。本次病发，患者意识清醒，精神良好，正常饮食，大便正常，小便正常，体重正常，睡眠正常。需要同治疾病，持续时间，用药情况，一般控制情况入院时用药：否认。<br><br>既往史：平素体健，其它疾病书写，否认“心血管疾病史”，否认“肾病史”，否认“肺病史”，否认“脑血管病史”，否认“伤寒史”，否认“肺结核史”，否认“肝炎史”，否认“内分泌系统疾病史”，否认“重大手术史”，否认“外伤史”，否认“中毒史”，否认“输血史”，否认“药物或食物过敏史”，预防接种史按当地社会进行。<br><br>个人史：<br><br>出生史：孕2产2，足月顺产，出生时无窒息、产伤史，出生体重3150g<br><br>喂养史：母乳喂养至3月，6个月开始添加辅食，无厌食偏食。生长发育史：3个月会抬头，6个月会坐，8个月会爬,现不会走，否认不良生活习惯史。<br><br>家族史：父亲体健，母亲体健，有兄弟姐妹：一姐姐，体健，否认家族性遗传病、精神病、传染病或类似的病史。</p></div>
"""

# 使用正则表达式提取信息
info_2_basic = {}

for key, pattern in patterns_2_basic.items():
    match = re.search(pattern, text)
    if match:
        if key == "孕周":
            value = match.group(1).strip()
            if value == "足月":
                value = 38
            else:
                value=value
        else:
            value = match.group(0).strip()
    else:
        value=''
    info_2_basic[key] = value

# 打印提取的信息
print("提取的信息：", info_2_basic)
